// 1 - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
// 2 - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
// 3 - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
// 4 - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
// 5 - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
// 6 - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
// 7 - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].
// 8 - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].
// 9 - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].
// 10 - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// 11 - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
// 12 - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
// 13 - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
// 14 - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.




// #1 done
//
// const task1 = ['a', 'b', 'c'];
// for (let i = 1; i <= 3; i++) {
// task1.push(i)
//  }
// console.log(task1);

// #2 NO
//  const task2 = [1, 2, 3];
// for (let i = 1; i >= 3; i++) {
//     task2.push(i)
// }
// console.log(task2);


// зворотній цикл






// #3 done
//
//  let task3 = [1, 2, 3]
// task3[3] = 4;
// task3[4] = 5;
// task3[5] = 6;
// //
// console.log(task3);


// #4 done
//
//  let task4 = [1, 2, 3]
// task4.unshift (4, 5, 6)
//
// console.log(task4);


// #5 done
//
// let task5 = ['js', 'css', 'jq'];
// let firstElement = task5.shift();
// console.log(firstElement);


// #6 done

// let task6 = ['js', 'css', 'jq'];
// let firsElement = task6.pop();
// console.log(firsElement);


// 7 - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].
//DONE!
   // const task7 = [1, 2, 3, 4, 5];
   /// console.log(task7.slice(3));

// 8 - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].
// done
// let task8 = [1, 2, 3, 4, 5];
// console.log(task8.slice(0,2 ));


// 12 - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи,
// значення яких є парними.
// DONE

// const task12 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// for (let i = 0; i < task12.length; i++) {
//     if (task12[i] % 2 === 0) {
//         console.log(task12[i]);
//     }
// }













//1 --створити масив та вивести його в консоль: DONE
// a)    - з 5 числових значень
// b) - з 5 стічкових значень
// c) - з 5 значень стрічкового, числового та булевого типу
// d) - Створити пустий масив. Наповнити його будь-якими значеннями звертаючись
// до конкретного індексу. Вивести в консоль

//   const dzA = [1, 2, 3, 4, 5];
//   const dzB = ['one', 'two', 'three', 'four', 'five'];
//   const dzC = [true, false, 'six', 'seven', 8];
//   const dzD = [];
//   dzD[1] = 'zero';
//   dzD[2] = 0;
// console.log(dzD);


// - За допомогою циклу for і document.write() вивести 10 блоків
// div c довільним текстом всередині

// let dz2






// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)
// - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
// Додатково

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// let i = ['a', 'b', 'c'];
// for (i = ; i < ; i++)
// console.log(i)


// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.





